{
  "AUTH": {
    "SIGN_IN": {
      "TITLE": "Chào mừng trở lại Ventidole",
      "DONT_HAVE_ACCOUNT": "Bạn chưa có tài khoản?"
    },
    "VERIFY_EMAIL": {
      "TITLE": "Xác minh email của bạn"
    },
    "SIGN_UP": {
      "TITLE": "Đăng ký tài khoản mới",
      "TERMS_AGREEMENT": "Tôi đồng ý với Điều khoản & Điều kiện"
    },
    "RESET_PASSWORD": {
      "TITLE": "Đặt lại mật khẩu của bạn"
    },
    "COMPLETE": {
      "REGISTER": {
        "TITLE": "Đăng ký hoàn tất!",
        "SUBTITLE": "Chào mừng đến với Ventidole! Tài khoản của bạn đã được tạo thành công."
      },
      "RESET_PASSWORD": {
        "TITLE": "Đặt lại mật khẩu hoàn tất!",
        "SUBTITLE": "Mật khẩu của bạn đã được đặt lại thành công. Bạn có thể đăng nhập bằng mật khẩu mới."
      }
    },
    "CHOOSE_COMMUNITY": {
      "TITLE": "Chọn cộng đồng của bạn",
      "SUBTITLE": "Chọn ít nhất 3 cộng đồng",
      "SEARCH_PLACEHOLDER": "Tìm kiếm cộng đồng",
      "NO_COMMUNITIES_FOUND": "Không tìm thấy cộng đồng nào",
      "FOLLOW_SUCCESS": "Theo dõi cộng đồng thành công!",
      "FOLLOW_ERROR": "Không thể theo dõi cộng đồng",
      "SELECT_AT_LEAST_3": "Vui lòng chọn ít nhất 3 cộng đồng",
      "MEMBERS": "{{count}} thành viên"
    },
    "EULA": {
      "TITLE": "Thỏa thuận cấp phép người dùng cuối",
      "CANCEL": "Hủy",
      "INTRO": "Thỏa thuận cấp phép người dùng cuối (\"Thỏa thuận\") này là hợp đồng pháp lý giữa bạn (\"Người dùng\") và Ventidole Inc. (\"Bên cấp phép\"), điều chỉnh việc bạn sử dụng nền tảng fan-idol Ventidole (\"Ứng dụng\"). Bằng cách tạo tài khoản hoặc sử dụng Ứng dụng, bạn đồng ý với các điều khoản này. Nếu bạn không đồng ý, vui lòng ngừng sử dụng ngay lập tức.",
      "LICENSE_GRANT": {
        "TITLE": "1. CẤP PHÉP",
        "DESCRIPTION": "Theo Thỏa thuận này, Bên cấp phép cấp cho bạn giấy phép hạn chế, không độc quyền, không thể chuyển nhượng và có thể thu hồi để sử dụng Ứng dụng cho mục đích cá nhân, phi thương mại. Bạn không được sao chép, sửa đổi hoặc phân phối lại bất kỳ phần nào của Ứng dụng mà không có sự cho phép."
      },
      "ACCOUNT": {
        "TITLE": "2. ĐĂNG KÝ TÀI KHOẢN & CHẤM DỨT",
        "DESCRIPTION": "Bạn phải cung cấp thông tin chính xác khi tạo tài khoản. Bên cấp phép có quyền đình chỉ hoặc chấm dứt tài khoản vì bất kỳ vi phạm nào đối với các điều khoản này hoặc hành vi gây hại cho cộng đồng. Bạn có thể chấm dứt tài khoản của mình bất cứ lúc nào thông qua cài đặt trong ứng dụng."
      },
      "USER_CONTENT": {
        "TITLE": "3. NỘI DUNG DO NGƯỜI DÙNG TẠO",
        "DESCRIPTION": "Ứng dụng cho phép người dùng tạo và chia sẻ bài đăng, bình luận, hình ảnh và nội dung khác.\n\n3.1. Quyền sở hữu nội dung\n\nBạn giữ quyền sở hữu nội dung của mình nhưng cấp cho Ventidole giấy phép không độc quyền, toàn cầu, miễn phí bản quyền để sử dụng, hiển thị và phân phối nội dung trong nền tảng.\n\n3.2. Nội dung bị cấm\n\nChúng tôi không khoan dung với:\n\n    • Quấy rối, phát ngôn thù địch hoặc phân biệt đối xử\n    • Nội dung khiêu dâm, bạo lực hoặc khiêu khích\n    • Lừa đảo, mạo danh hoặc thông tin gây hiểu lầm\nVi phạm có thể dẫn đến đình chỉ tài khoản ngay lập tức hoặc xóa nội dung."
      },
      "MEMBERSHIP": {
        "TITLE": "4. TÙY CHỌN THÀNH VIÊN & ĐĂNG KÝ",
        "DESCRIPTION": "Ventidole cung cấp các gói thành viên tùy chọn và mua hàng kỹ thuật số như vé sự kiện, token và hàng hóa idol. Giá cả và quyền lợi được hiển thị trong ứng dụng. Tất cả thanh toán được xử lý an toàn thông qua các nhà cung cấp bên thứ ba. Thành viên sẽ tự động gia hạn trừ khi hủy trước ngày gia hạn."
      },
      "COMMUNITY": {
        "TITLE": "5. TƯƠNG TÁC CỘNG ĐỒNG & CHẶN",
        "DESCRIPTION": "Bạn có thể theo dõi idol, bình luận và nhắn tin với các fan khác. Bạn có thể chặn người dùng có hành vi lạm dụng. Sau khi bị chặn, họ không thể liên hệ hoặc xem hồ sơ của bạn."
      },
      "PRIVACY": {
        "TITLE": "6. QUYỀN RIÊNG TƯ & SỬ DỤNG DỮ LIỆU",
        "DESCRIPTION": "Quyền riêng tư của bạn rất quan trọng với chúng tôi. Vui lòng xem Chính sách bảo mật của chúng tôi để biết chi tiết về cách dữ liệu cá nhân của bạn được thu thập và xử lý. Chúng tôi không bao giờ bán thông tin cá nhân của bạn cho bên thứ ba."
      },
      "CODE_OF_CONDUCT": {
        "TITLE": "7. QUY TẮC ỨNG XỬ",
        "DESCRIPTION": "Bạn đồng ý:\n\n    • Đối xử tôn trọng với người dùng khác\n    • Tránh hành vi xúc phạm hoặc spam\n    • Tôn trọng quyền sở hữu trí tuệ của idol và người sáng tạo\nVi phạm lặp lại có thể dẫn đến đình chỉ hoặc cấm vĩnh viễn."
      },
      "DIGITAL_ITEMS": {
        "TITLE": "8. VẬT PHẨM KỸ THUẬT SỐ & TOKEN",
        "DESCRIPTION": "Một số tính năng có thể bao gồm đồ sưu tầm kỹ thuật số, token hoặc tài sản dựa trên NFT. Quyền sở hữu các tài sản này tuân theo bản ghi công khai của blockchain. Người dùng có trách nhiệm bảo vệ ví của họ và hiểu rủi ro của các giao dịch kỹ thuật số."
      },
      "LIABILITY": {
        "TITLE": "9. GIỚI HẠN TRÁCH NHIỆM",
        "DESCRIPTION": "Ventidole và các chi nhánh không chịu trách nhiệm cho các thiệt hại gián tiếp hoặc hậu quả, bao gồm mất dữ liệu hoặc hàng hóa ảo, do việc bạn sử dụng Ứng dụng. Ứng dụng được cung cấp \"NGUYÊN TRẠNG\" mà không có bất kỳ bảo đảm nào về dịch vụ liên tục hoặc không có lỗi."
      },
      "ELIGIBILITY": {
        "TITLE": "10. ĐỦ ĐIỀU KIỆN",
        "DESCRIPTION": "Bạn phải ít nhất 16 tuổi để sử dụng Ứng dụng. Một số khu vực có thể yêu cầu sự đồng ý của phụ huynh đối với trẻ vị thành niên. Tài khoản idol hoặc người sáng tạo phải tuân thủ tất cả các luật địa phương và quy trình xác minh."
      },
      "GOVERNING_LAW": {
        "TITLE": "11. LUẬT ĐIỀU CHỈNH",
        "DESCRIPTION": "Thỏa thuận này được điều chỉnh bởi luật pháp của Bang Delaware, Hoa Kỳ, không tính đến các quy định xung đột pháp luật. Các tranh chấp sẽ được giải quyết thông qua trọng tài ràng buộc trừ khi bị cấm bởi luật địa phương."
      },
      "THIRD_PARTY": {
        "TITLE": "12. DỊCH VỤ BÊN THỨ BA",
        "DESCRIPTION": "Ứng dụng có thể tích hợp các dịch vụ bên thứ ba (ví dụ: Google, Apple, cổng thanh toán). Bạn đồng ý tuân theo các điều khoản tương ứng của họ. Ventidole không chịu trách nhiệm cho bất kỳ lỗi dịch vụ bên ngoài nào."
      },
      "UPDATES": {
        "TITLE": "13. CẬP NHẬT & SỬA ĐỔI",
        "DESCRIPTION": "Ventidole có thể cập nhật các điều khoản này định kỳ. Việc tiếp tục sử dụng Ứng dụng sau khi các thay đổi có hiệu lực đồng nghĩa với việc bạn chấp nhận Thỏa thuận đã sửa đổi."
      },
      "CONTACT": {
        "TITLE": "14. THÔNG TIN LIÊN HỆ",
        "DESCRIPTION": "Nếu bạn có bất kỳ câu hỏi hoặc thắc mắc nào về Thỏa thuận này, vui lòng liên hệ với chúng tôi tại support@ventidole.app."
      },
      "ACCEPTANCE": {
        "TITLE": "CHẤP NHẬN",
        "DESCRIPTION": "Bằng cách nhấp vào \"Đồng ý\" hoặc tiếp tục sử dụng Ứng dụng, bạn xác nhận rằng bạn đã đọc và hiểu Thỏa thuận này và đồng ý với các điều khoản của nó, bao gồm hướng dẫn cộng đồng, hạn chế nội dung và chính sách vật phẩm kỹ thuật số."
      }
    }
  },
  "APP": {},
  "LABEL": {
    "EMAIL": "Email",
    "PASSWORD": "Mật khẩu",
    "VERIFICATION_CODE": "Mã xác minh",
    "USERNAME": "Tên người dùng",
    "CONFIRM_PASSWORD": "Xác nhận mật khẩu",
    "NEW_PASSWORD": "Mật khẩu mới",
    "CONFIRM_NEW_PASSWORD": "Xác nhận mật khẩu mới"
  },
  "PLACEHOLDER": {
    "EMAIL": "johndoe@gmail.com",
    "PASSWORD": "Nhập mật khẩu",
    "VERIFICATION_CODE": "Nhập mã xác minh",
    "USERNAME": "Nhập tên người dùng",
    "CONFIRM_PASSWORD": "Nhập lại mật khẩu",
    "NEW_PASSWORD": "Nhập mật khẩu mới",
    "CONFIRM_NEW_PASSWORD": "Nhập lại mật khẩu mới"
  },
  "BUTTON": {
    "FORGET_PASSWORD": "Quên mật khẩu?",
    "SIGN_UP": "Đăng ký",
    "SIGN_IN": "Đăng nhập",
    "SEND_OTP": "Gửi mã OTP",
    "RESEND_OTP": "Gửi lại mã OTP",
    "WAIT_SECONDS": "Chờ {{seconds}} giây",
    "VERIFY": "Xác minh",
    "TERMS_AGREEMENT": "Điều khoản & Điều kiện",
    "CONTINUE": "Tiếp tục",
    "RESET_PASSWORD": "Đặt lại mật khẩu",
    "GET_STARTED": "Bắt đầu",
    "BACK_TO_LOGIN": "Quay lại đăng nhập"
  },
  "VALIDATION": {
    "INVALID_EMAIL": "Địa chỉ email không hợp lệ",
    "PASSWORD_MIN_LENGTH": "Mật khẩu phải có ít nhất 8 ký tự",
    "PASSWORD_UPPERCASE": "Mật khẩu phải chứa ít nhất một chữ cái viết hoa",
    "PASSWORD_LOWERCASE": "Mật khẩu phải chứa ít nhất một chữ cái viết thường",
    "PASSWORD_NUMBER": "Mật khẩu phải chứa ít nhất một số",
    "PASSWORD_REQUIRED": "Mật khẩu là bắt buộc",
    "INVALID_PHONE": "Định dạng số điện thoại không hợp lệ",
    "INVALID_URL": "Định dạng URL không hợp lệ",
    "NAME_REQUIRED": "Tên là bắt buộc",
    "NAME_TOO_LONG": "Tên quá dài",
    "MESSAGE_MIN_LENGTH": "Tin nhắn phải có ít nhất 10 ký tự",
    "MESSAGE_TOO_LONG": "Tin nhắn quá dài",
    "PASSWORDS_DONT_MATCH": "Mật khẩu không khớp",
    "OTP_REQUIRED": "Mã xác minh phải có từ 4-6 chữ số",
    "OTP_LENGTH": "Mã OTP phải có 4 chữ số",
    "USERNAME_MIN_LENGTH": "Tên người dùng phải có ít nhất 3 ký tự",
    "USERNAME_TOO_LONG": "Tên người dùng quá dài",
    "PHONE_NUMBER_INVALID": "Số điện thoại phải có 10 chữ số"
  }
}
